esp-cpp/espp/components/wdi/usb_example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# Native USB (USB-OTG) is handed to TinyUSB for the WDI HID interface, and on the
# ESP32-S3 USB-Serial-JTAG shares that PHY, so the console runs on UART0 (with
# USB-Serial-JTAG as an early-boot secondary). Use a UART adapter for monitor.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_HID_BUFSIZE=64
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_CDC_COUNT=0
CONFIG_TINYUSB_VENDOR_COUNT=0
